Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/buying_a_home/stamp_duty.html.txt.tmx
Source language: en
Languages: ga

source: Stamp duty on property
ga: Dleacht stampála ar réadmhaoin

source: Stamp duty is charged on the instruments used in the transfer of property – that is, on the conveyance documents that transfer ownership of the property
ga: Gearrtar dleacht stampála ar na hionstraimí a úsáidtear in aistriú réadmhaoine – i bhfriotal eile, na cáipéisí tíolacais a aistríonn úinéireacht na réadmhaoine

source: In general, the only factor affecting the amount of stamp duty is the value of the property
ga: Go ginearálta, is é an t-aon rud a dhéanann difear don mhéid dleacht stampála atá le híoc luach na réadmhaoine

source: Stamp duty applies to residential property such as houses, apartments or sites with agreement to build. It is also payable on non-residential property, that is, land or housing sites without residential buildings - see Rates below
ga: Gearrtar dleacht stampála ar réadmhaoin chónaithe ar nós tithe nó árasán.Má tá do chomhaontú chun suíomh a cheannach ceangailte le conradh tógála, d’fhéadfadh dleacht stampála bheith iníoctha ar an méid iomlán den suíomh móide an conradh tógála

source: Budget 2015: changes were announced to consanguinity relief - see below
ga: Tá sé le híoc, freisin, ar réadmhaoin neamhchónaithe, is é sin, talamh nó suíomhanna tí nach bhfuil foirgnimh chónaithe acu – féach ‘Rátaí’ thíos

source: A simplified stamp duty system was introduced on 8 December 2010 - see Rates below
ga: Tugadh isteach córas simplithe dleacht stampála an 8 Nollaig 2010 – féach ‘Rátaí’ thíos

source: Before that date there was a complex system of exemptions and reliefs for stamp duty on residential property
ga: Roimh an dáta sin, b’ann do chóras casta d’eisceachtaí agus faoiseamh le haghaidh dleacht stampála ar réadmhaoin chónaithe

source: These earlier rules are summarised in Further information below
ga: Déantar na rialacha níos luaithe seo a achoimriú in ‘Tuilleadh Faisnéise’ thíos

source: “Residential property” includes houses and apartments
ga: Áirítear le “réadmhaoin chónaithe” tithe agus árasáin

source: It also includes sites with agreement to build
ga: Áirítear léi freisin suíomhanna a bhfuil aontú le tógáil ann ina leith

source: • If you buy a site in connection with (or as part of) an arrangement to build a house or apartment on it, then stamp duty will be charged at the residential property rate on the total of the site cost and the building cost
ga: • Má cheannaíonn tú suíomh lena ngabhann socraíocht (nó má cheannaíonn tú suíomh atá mar chuid de shocraíocht) chun teach nó árasán a thógáil air, gearrfar dleacht stampála de réir an ráta réadmhaoine cónaithe ar chostas iomlán an tsuímh agus na tógála

source: • If you buy a site with no connected arrangement to build a house or apartment on it, then stamp duty will be charged on the site cost at the non-residential property rate
ga: • Má cheannaíonn tú suíomh gan aon socraíocht a bheith ag gabháil leis chun teach nó árasán a thógáil air, gearrfar dleacht stampála de réir an ráta réadmhaoine neamhchónaithe ar chostas an tsuímh

source: Read more on the Revenue website here
ga: Léigh tuilleadh ar láithreán Gréasáin na gCoimisinéirí Ioncaim anseo

source: Read here how large gardens, car parking spaces and marina berths are treated for stamp duty purposes
ga: Léigh anseo faoin dóigh a ndéileáiltear chun críocha dleacht stampála le gairdíní móra, le spásanna páirceála agus le beartanna muiríne

source: Transfers between spouses, civil partners and cohabitants
ga: Aistrithe idir céilí, páirtnéirí sibhialta agus comháititheoirí

source: In general, the following transactions are exempt from stamp duty:
ga: Go ginearálta, bíonn na hidirbhearta a leanas díolmhaithe ó dhleacht stampála:

source: • All transfers/leases of property between spouses and civil partners (unless the transfer is a subsale – a sale carried out within the process of a larger sale)
ga: • Gach aistriú/léasú réadmhaoine idir céilí agus páirtnéirí sibhialta (murar aistriú fodhíola an t-aistriú - díol faoina dtugtar laistigh de phróiseas díola níos mó)

source: • Property transferred between former spouses/civil partners under a court order, following a divorce or the dissolution of a civil partnership
ga: • Réadmhaoin a aistrítear idir iarchéilí/iarpháirtnéirí sibhialta faoi ordú cúirte, i ndiaidh colscartha nó díscaoileadh páirtnéireacht shibhialta

source: • Property transferred by a cohabitant to his or her cohabitant, on or after 1 January 2011, under a Property Adjustment Order
ga: • Réadmhaoin a d’aistrigh comháititheoir chuig a chomháitheoir nó a comháititheoir, an 1 Eanáir 2011 nó ina dhiaidh sin, faoi Ordú coigeartaithe réadmhaoine

source: Read more in our document on family and shared homes
ga: Is féidir leat níos mó a léamh inár gcáipéis ar theach an teaghlaigh agus tithe comhroinnte

source: While the above transactions are in general exempt from stamp duty, the exemption does not apply if any other person is a party to the instrument
ga: Cé go bhfuil na hidirbhearta thuas, go ginearálta, díolmhaithe ó dhleacht stampála, ní bhaineann an díolúine más páirtí aon duine eile leis an ionstraim

source: In the case of non-residential property, stamp duty is payable at half the normal rate applicable if there is a transfer of property (other than shares) to certain relatives - for example, a parent, grandparent, step-parent, child, brother, sister, half-brother, half-sister, aunt, uncle, niece or nephew
ga: I gcás réadmhaoin neamhchónaithe, tá dleacht stampála le híoc ar leath an ghnáthráta más ann d’aistriú réadmhaoine (seachas scaireanna) go dtí gaolta áirithe – mar shampla, tuismitheoir, seantuismitheoir, leastuismitheoir, leanbh, deartháir, deirfiúr, leathdheartháir, leathdheirfiúr, aintín, uncail, neacht nó nia

source: This consanguinity relief is not available on leases or on transactions involving cousins and/or in-laws
ga: Níl an faoiseamh gaol fola seo ar fáil ar léasanna nó ar idirbhearta lena mbaineann col ceathracha agus/nó na gaolta pósta

source: Consanguinity relief is due to expire on 31 December 2014
ga: Cuirfear deireadh leis i ndiaidh an 31 Nollaig 2014

source: For residential property, consanguinity relief was abolished since 8 December 2010
ga: I gcás réadmhaoin chónaithe, cuireadh deireadh le faoiseamh gaol fola ón 8 Nollaig 2010

source: Clawback of stamp duty relief
ga: Aisghlámadh faoiseamh dleacht stampála

source: A stamp duty clawback arises where rent, other than under the Rent a Room scheme, is obtained within the 2-year period (or up to the date of a sale during this period) from the date of the purchase deed
ga: Bíonn aisghlámadh (‘clawback’) dleacht stampála i gceist nuair a fhaightear cíos, seachas faoin scéim ‘Seomra a Ligean ar Cíos’, laistigh den tréimhse 2 bhliain (nó a fhad le dáta díola le linn na tréimhse seo) ó dháta an ghníomhais cheannaithe

source: The amount of the clawback is the difference between (a) the stamp duty payable at the higher rates which would have applied at the date of the purchase deed and (b) the lower duty (if any) paid as a result of getting the benefit of reduced stamp duty rates
ga: Is é méid an aisghlámtha an difríocht idir (a) an dleacht stampála iníoctha ag na rátaí níos airde a bheadh i bhfeidhm ag dáta an ghníomhais cheannaithe agus (b) an dleacht níos ísle (más ann dó) íoctha mar thoradh ar leas a bheith bainte as rátaí dleacht stampála laghdaithe

source: Under the Rent a Room scheme, there is no stamp duty clawback where rent is received by the person in occupation of the house or apartment on or after 6 April 2001 for letting of furnished accommodation in part of the house
ga: Faoin scéim Seomra a ligean ar Cíos, níl aon aisghlámadh ar dhleacht stampála ar fáil sa chás go bhfuair an duine an cíos a chónaíonn sa teach nó san árasán an 6 Aibreán 2001 nó ina dhiaidh sin mar gheall ar chóiríocht faoi throscán a ligean i gcuid den teach

source: This relief was for farmers who sold some agricultural land and bought more in order to consolidate their holdings and improve the viability of their farms
ga: Bhí an faoiseamh seo d’fheirmeoirí a dhíol roinnt talamh talmhaíochta agus a cheannaigh níos mó lena sealúchas a chomhdhlúthú agus feabhas a chur ar inmharthanacht a bhfeirmeacha

source: It is no longer applicable
ga: Ní sé i bhfeidhm a thuilleadh

source: │Property value │Rate │
ga: │Luach réadmhaoine │Ráta │

source: │Up to €1,000,000 │1% │
ga: │A mhéid le €1,000,000 │1% │

source: For people buying their homes under local authority tenant purchase and similar schemes, a maximum amount of €100 is charged in stamp duty
ga: I gcás daoine a gceannaíonn a dtithe faoi scéimeanna ceannaigh ag tionóntaí de chuid údarás áitiúil agus faoi scéimeanna dá samhail, gearrtar €100 ar a mhéid mar dhleacht stampála

source: There is no stamp duty payable on certain transfers between spouses, civil partners and cohabitants – see above
ga: Níl aon dleacht stampála iníoctha ar aistrithe áirithe idir céilí, páirtnéirí sibhialta agus comháititheoirí – féach thuas

source: If you paid VAT on your house, you only have to pay stamp duty on the base price of the house – before the VAT was added
ga: Má d’íoc tú cáin bhreisluacha (CBL) ar do theach (toisc gur cheannaigh tú é ó fhorbróir nó ó thógálaí), ní bheidh ort ach dleacht stampála ar bhonnphraghas an tí a íoc – is é sin, praghas an tí sular cuireadh an CBL leis

source: So, for example, if you paid €227,000 (including VAT) for your new house, this is made up of the base price of €200,000 plus 13.5% VAT (€27,000) and you only pay stamp duty on the base price of €200,000 Read more in our document on Value Added Tax
ga: Mar sin, má d’íoc tú €227,000 (CBL san áireamh) as do theach nua, tá an figiúr sin comhdhéanta den bhonnphraghas €200,000 móide CBL ag 13.5% (€27,000) – ní íocann tú dleacht stampála ach amháin ar an mbonnphraghas €200,000

source: Since 7 December 2011 there is a single rate of 2% on all non-residential property and the first €10,000 is no longer exempt from stamp duty
ga: Ón 7 Nollaig 2011, tá ráta singil 2% ann ar gach réadmhaoin neamhchónaithe agus níl an chéad €10,000 díolmhaithe a thuilleadh ó dhleacht stampála

source: Your solicitor will calculate how much stamp duty is due and request this from you before the sale is closed
ga: Beidh d’aturnae in ann a ríomh cé mhéid dleacht stampála atá le híoc agus iarrfar ort é seo a íoc sula ndúntar an díolachán

source: The amount is paid to the Revenue Commissioners, who place a stamp on the property deeds
ga: Íoctar an tsuim leis na Coimisinéirí Ioncaim, a chuireann stampa ar na gníomhais réadmhaoine

source: Without this stamp, the deeds cannot be registered
ga: Gan an stampa seo, ní féidir na gníomhais a chlárú

source: National Stamp Duty Office
ga: Oifig Náisiúnta Dleachta Stampála

source: Residential property: before 8 December 2010
ga: Réadmhaoin chónaithe: roimh an 8 Nollaig 2010

source: Before 8 December 2010, the amount of stamp duty payable varied according to the value of the property and your status (such as first-time buyer or investor)
ga: Roimh an 8 Nollaig 2010, b’éagsúil an méid dleacht stampála a bhí le híoc, de réir luach na réadmhaoine agus do stádais (mar shampla, ceannaitheoir céaduaire nó infheisteoir)

source: Stamp duty was divided up into different categories and rates and the amount you had to pay depended on your particular circumstances
ga: Roinneadh dleacht stampála ina cheithre chatagóir agus ráta éagsúla agus bhraith an méid a bhí ort a íoc ar do chúinsí ar leith

source: Up to 8 December 2010, first-time buyers who were owner-occupiers of new and second-hand residential property did not pay stamp duty
ga: Go dtí an 8 Nollaig 2010, níor íoc ceannaitheoirí céaduaire dleacht stampála a bhí mar úinéirí lonnaitheacha réadmhaoin nua agus athláimhe cónaithe

source: As a divorced or separated person, you could be considered a first-time buyer if you met certain conditions
ga: Agus tú mar dhuine colscartha nó idirscartha, d’fhéadfaí caitheamh leat mar cheannaitheoir céaduaire dá gcomhlíonfá roinnt coinníollacha

source: People who rent out new or second-hand houses or apartments are considered investors
ga: Meastar gurb infheisteoirí daoine a ligeann tithe nó árasáin nua nó athláimhe ar cíos

source: Under the rules in force up to 8 December 2010, the same rates of stamp duty applied to investors as to non-first-time owner-occupiers
ga: Faoi na rialacha a bhí i bhfeidhm go dtí an 8 Nollaig 2010, bhí na rátaí céanna dleacht stampála i gceist d’infheisteoirí agus d’úinéirí lonnaitheacha neamh-chéaduaire
